{
  "Changes": [
    {
      "LogName": "Load Marriage Dialogue",
      "Action": "Load",
      "Priority": "High",
      "Target": "Characters/Dialogue/Lance",
      "FromFile": "data/Blank.json"
    },
    {
      "Action": "EditData",
      "Target": "Characters/Dialogue/Lance",
      "Entries": {
        //Special Dialogue
        "danceRejection": "{{i18n:Lance.danceRejectionCharacterDialogue_{{Random:{{Range: 0, 5}}}}}}",
        "MovieInvitation": "{{i18n:Lance.MovieInvitationCharacterDialogue_0}}",
        "breakUp": "{{i18n:Lance.CharacterDialogue_breakup{{Random:{{Range: 0, 5}}}}}}",
        "divorced": "{{i18n:Lance.CharacterDialogue_divorce{{Random:{{Range: 0, 5}}}}}}",
        "dumped_Guys": "{{i18n:Lance.CharacterDialogue.dumped}}",
        "secondChance_Guys": "{{i18n:Lance.CharacterDialogue.secondchance}}",
        "highlandsDwarf": "{{i18n:Lance.CharacterDialogue_hDwarf}}",
        "Resort": "{{i18n:Lance.ResortCharacterDialogue_{{Random:{{Range: 0, 5}}}}}}",
        "Resort_Bar": "{{i18n:Lance.Resort_BarCharacterDialogue_{{Random:{{Range: 0, 5}}}}}}",
        "Resort_Chair": "{{i18n:Lance.Resort_ChairCharacterDialogue_0}}",
        "Resort_Dance": "{{i18n:Lance.Resort_DanceCharacterDialogue_0}}",
        "Resort_Entering": "{{i18n:Lance.Resort_EnteringCharacterDialogue_0}}",
        "Resort_Leaving": "{{i18n:Lance.Resort_LeavingCharacterDialogue_0}}",
        "Resort_Shore": "{{i18n:Lance.Resort_ShoreCharacterDialogue_{{Random:{{Range: 0, 5}}}}}}",
        "Resort_Towel": "{{i18n:Lance.Resort_TowelCharacterDialogue_0}}",
        "Resort_Umbrella": "{{i18n:Lance.Resort_UmbrellaCharacterDialogue_0}}",
        "Resort_Wander": "{{i18n:Lance.Resort_WanderCharacterDialogue_{{Random:{{Range: 0, 5}}}}}}",
        "GreenRain": "{{i18n:Lance.GreenRain{{Random:{{Range: 0, 5}}}}}}",
        "GreenRainFinished": "{{i18n:Lance.GreenRainFinished{{Random:{{Range: 0, 5}}}}}}",
        "{{ModId}}_Passout": "{{i18n:Lance.Passout.ConversationTopic}}",

        "AcceptGift_(O)StardropTea": "{{i18n:Lance.GiftStardropTea}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Aged_Blue_Moon_Wine": "{{i18n:Lance.GiftAgedBlueMoonWine}}",
        "AcceptGift_(O)907": "{{i18n:Lance.Gift907}}",
        "AcceptGift_(O)218": "{{i18n:Lance.Gift218}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Gemfish": "{{i18n:Lance.GiftGemfish}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Torpedo_Trout": "{{i18n:Lance.GiftTorpedoTrout}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Void_Shard": "{{i18n:Lance.GiftVoidShardpre}}",
        "AcceptBirthdayGift_Positive": "{{i18n:Lance.GiftBDpos}}",
        "AcceptBirthdayGift_Negative": "{{i18n:Lance.GiftBDneg}}",

        "AcceptBouquet": "{{i18n:AcceptBouquet}}",

        ////////////other marriage
        "MarriedWizard": "{{i18n:Lance.MarriedWizardCharacterDialogue_0}}",
        "RoommatesKrobus": "{{i18n:Lance.RoommatesKrobusCharacterDialogue_0}}",

        ////daily dialogue
        "Mon": "{{i18n:Mon.Lance.CharacterDialogue_{{Random:{{Range: 0, 5}}}}}}",
        "Tue": "{{i18n:Tue.Lance.CharacterDialogue_{{Random:{{Range: 0, 5}}}}}}",
        "Wed": "{{i18n:Wed.Lance.CharacterDialogue_{{Random:{{Range: 0, 5}}}}}}",
        "Thu": "{{i18n:Thu.Lance.CharacterDialogue_{{Random:{{Range: 0, 5}}}}}}",
        "Fri": "{{i18n:Fri.Lance.CharacterDialogue_{{Random:{{Range: 0, 5}}}}}}",
        "Sat": "{{i18n:Sat.Lance.CharacterDialogue_{{Random:{{Range: 0, 5}}}}}}",
        "Sun": "{{i18n:Sun.Lance.CharacterDialogue_{{Random:{{Range: 0, 5}}}}}}"
      }
    },
    {
      "LogName": "Compensating for Custom Farms",
      "Action": "EditData",
      "When": {
        "Relationship:Lance": "Married",
        "Custom Farmhouse": false
      },
      "Target": "Characters/Dialogue/Lance",
      "Entries": {
        "AcceptGift_(O){{ModId}}_Razor": "$v LSSELanceRazor true false"
      }
    },
    {
      "LogName": "Compensating for Custom Farms",
      "Action": "EditData",
      "When": {
        "Relationship:Lance": "Married",
        "Custom Farmhouse": true
      },
      "Target": "Characters/Dialogue/Lance",
      "Entries": {
        "AcceptGift_(O){{ModId}}_Razor": "$action AddMail Current {{ModId}}_BeardNo Received"
      }
    },
    {
      "LogName": "Gifts: Married No events Gift Reactions",
      "Action": "EditData",
      "Priority": "Late",
      "When": {
        "Relationship:Lance": "Married"
      },
      "Target": "Characters/Dialogue/Lance",
      "Entries": {
        "AcceptGift_(O)StardropTea": "{{i18n:AcceptGift_(O)StardropTea}}",
        "AcceptGift_(O)96": "Ah, have you happened upon a scroll from the mines?$14#$b#I hear they're scattered around everywhere.$15#$b#Hmm? Would you like help translating it? Don't worry, I'm well versed in dwarvish.$8",
        "AcceptGift_(O)97": "Oh, ready for round two?$15#$b#Do you remember anything from our last session?$14#$b#No?$8#$b#What am I to do with you?$9",
        "AcceptGift_(O)98": "Round three, yet you didn't remember the first lesson.$8#$b#I think you're just excited about listening to me speak dwarvish.$9#$b#I can whisper sweet nothings to you in most languages, you need but ask.$13",
        "AcceptGift_(O)99": "Fourth time's the charm, huh?$13#$b#Are you sure you're not just throwing these at me because you've found multiples?$8#$b#I will not argue, I do enjoy reading over them in my spare time, thank you, my love.$9",
        "AcceptGift_(O)103": "What... is that?$3#$b#I don't think that's quite safe, my love, let me dispose of it for you.$2#$e#%Lance burned the doll...",
        "AcceptGift_(O)104": "Oh lovely, I do enjoy how the elvish designs glisten in the sunlight.$13#$b#It's for me?$14#$b#Are you sure?$2#$b#I'll have to ask the dwarves if they can fashion anything for me in return, then. Thank you my love.$13",
        "AcceptGift_(O)107": "An egg... no... That's not quite right.$14#$e#A dinosaur egg??$99#$b#I didn't think those monsters in the mines could still reproduce..$14#$b#Fascinating! Thank you my love, I'll be sure to start up a new research project!$99",
        "AcceptGift_(O)109": "My collection of swords is quite expansive already, my love.$8#$b#I will accept, nonetheless.$13#$b#I assume Marlon will be pleased with another one of my 'magic sword' projects.$8",
        "AcceptGift_(O)114": "...While I understand that this is quite rare and important, I feel as if you're poking fun at me.$3#$b#Would Magnus not have been a better recipient of this?$9#$b#Oh, you wanted me to use it as a tactic to talk to Magnus?$99#$b#I will not decline then...$8",
        "AcceptGift_(O)121": "%Lance is giggling.#$e#My love, you cannot speak dwarvish just because you wear one of their helmets!$15#$b#It's for me?$14#$b#...I'm not quite sure why I would need one of these, but I suppose a passing gift to the Highlands dwarves wouldn't hurt.$8#$b#Thank you, my love, I'll be sure to tell them it was from you.$9",
        "AcceptGift_(O)122": "Oh a translator!$99#$b#These are the most recent version of it, it's quite fascinating to see the dwarves at work.$8#$b#Would you like to take a trip some time to speak to them some more?$13",
        "AcceptGift_(O)124": "I know that you're enthusiastic about magic, my love, but that is not something to be toyed with.$20#$b#If you don't mind, I will take it to Magnus to have it handled.$21#$e#%Lance is talking to Magnus through communication magic.#$e#Well yes, I mean @ brought it to my attention.$23#$e#I have not done anything worth scrutiny!$25#$e#Listen, I'll bring this to you later, Mag. It's not too serious.$26",
        "AcceptGift_(O)125": "This one is at least a little less volatile than the last 'golden' object you brought me.$8#$b#I will not have to bother Magnus with this one.$9#$e#What does it do? Hmmm...$3#$b#That, I'm not quite sure of, my love, if you're truly curious, you can ask Magnus sometime.$8",
        "AcceptGift_(O)16": "Ah what is it, the 'false wasabi'?$8#$b#I kid, but really, I would enjoy fresh wasabi every now and then, especially when you're so willing to bring me sushi dishes.$9",
        "AcceptGift_(O)18": "Daffodil tea is quite refreshing, no?$8#$b#I see that you're having good tidings this season.$9#$b#I appreciate your small gestures, my love.$8",
        "AcceptGift_(O)20": "Oh? Are we going to have something Asian-themed tonight?$99#$b#You know I do love anything from the East.$9",
        "AcceptGift_(O)22": "Dandelions are considered weeds, but I truly do enjoy when they're dried and immersed in a good mead.$8#$b#Maybe that's just the adventurer in me, trying to find ways to enjoy myself among the wilderness.$9#$b#I appreciate your sentiments, my love.$8",
        "AcceptGift_(O)24": "I do love your lunches, is this you trying to tell me you would like me to cook tonight?$99#$b#I don't have any qualms about cooking, just say the word and we'll have whatever you'd like.$8",
        "AcceptGift_(O)78": "While obtuse, cave carrots are quite rich in nutrients, especially when you're stuck underground for so long.$9#$b#I recall Magnus nagging at me after I got lost in a mineshaft for oever a week.$8",
        "AcceptGift_(O)88": "Coconuts are the best thing for summertime, are they not?$13#$b#Unless this is you telling me that you want me to cook my 'famous' Thai curry.$99#$e#Don't worry, my love, you can spice it however you wish.$8",
        "AcceptGift_(O)90": "I recall being lost in the desert for several days.$8#$b#Magnus was not all too pleased with me coming back with my skin looking like a fresh lizard.$9#$b#I do not suggest drinking from these, my love, most of them have poisonous properties.$8#$b#Depending on the variety you've brought, though, I have no problem making licuado de nopal as a refreshment.$13",
        "AcceptGift_(O)92": "Ah... were you concerned about my trips out to the Highlands?$14#$b#I assure you, my magic is quite rife with energy.$8",
        "AcceptGift_(O)174": "In the mood for some egg dishes today, my love?$8#$b#What will we have today?$9#$b#Omelete rice?$1#$b#Kimchi and eggs?$10#$b#Maybe just some marinated eggs as a side dish tonight?$8",
        "AcceptGift_(O)176": "Oh? Lighter eggs today?$10#$b#Did you want to try my special mayak gyeran?$8",
        "AcceptGift_(O)178": "Hay, is for horses.$2#$b#I kid, but I do not know why you would give me something like this, unless you're telling me you're going to ride your horse around the yard...?$13",
        "AcceptGift_(O)180": "Oh? Lighter eggs today?$10#$b#Did you want to try my special mayak gyeran?$8",
        "AcceptGift_(O)182": "In the mood for some egg dishes today, my love?$8#$b#What will we have today?$9#$b#Omelete rice?$1#$b#Kimchi and eggs?$10#$b#Maybe just some marinated eggs as a side dish tonight?$8",
        "AcceptGift_(O)184": "Are you telling me you'd like a cream stew today?$13#$b#If you don't mind me taking up the vegetables, I will happily oblige.$8",
        "AcceptGift_(O)186": "Are you telling me you'd like a cream stew today?$13#$b#If you don't mind me taking up the vegetables, I will happily oblige.$8",
        "AcceptGift_(O)188": "I'm not quite a fan of green beans...$3#$b#I know that's childish for someone like me.$2#$e#It's just... the texture of it.$17#$b#Absolutely vile.$18",
        "AcceptGift_(O)190": "I'm not picky when it comes to floretes, whether it be broccoli or cauliflower.$8#$b#I am a bit of a fanatic about eating them with every meal, I agree.$9",
        "AcceptGift_(O)192": "Hmm? Are you at a loss for what to cook tonight?$14#$b#Potatoes au gratin sounds quite nice tonight, doesn't it?$13",
        "AcceptGift_(O)245": "The fool's treat, is it?$8#$b#I try not to use too much of this in my recipes, but old habits die hard.$9",
        "AcceptGift_(O)246": "Hmmm? In the mood for some pasta tonight?$12#$b#What'll it be, my love?$13#$b#Although wheat flour is mainly used for Thai, so I assume you're wanting Pad Thai tonight?$8",
        "AcceptGift_(O)247": "In the mood for some stir fry tonight?$12#$b#Maybe some fried rice?$5",
        "AcceptGift_(O)248": "You do know I love putting garlic into everything.$8#$b#I apologize if that means we must brush our teeth after the meal, but it's just worth it isn't it?$9",
        "AcceptGift_(O)250": "I can't say I'm a fan of kale...$3#$b#Never quite sits with my stomach, it seems.$9",
        "AcceptGift_(O)251": "Oh? Interested in a bit of a tea ceremony today, are you?$13#$b#Although if you want me to dress ceremoniously, you'd have to follow suit.$8",
        "AcceptGift_(O)252": "It's quite fascinating how you manage to make pies out of such things like these.$8#$b#I appreciate all of your efforts nonetheless.$9",
        "AcceptGift_(O)254": "Interested in my special sous vide melon recipe?$8#$b#It makes it dangerously delicious, you know?$9",
        "AcceptGift_(O)256": "Another ...produce... that I don't quite enjoy.$3#$b#Again, textures are everything to me and tomatoes are definitely one of those things that grates my nerves.$8#$b#I know, I know, childish. I can't help it.$9#$b#And no, I refuse to argue with Demetrius on the specifics of what a tomato actually is.$8",
        "AcceptGift_(O)257": "Oh! In the mood for a mushroom dish tonight?$99#$b#I do love how these taste with almost anything.$8",
        "AcceptGift_(O)258": "MMh?!$14#$b#%I shoved blueberries in Lance's face.#$b#!!!$14#$b#While I do love all fruit *cough* you could at least give me a warning beforehand, my love.$99",
        "AcceptGift_(O)259": "Fiddleheads?$2#$b#I'll be honest, I haven't eaten fiddleheads since my adoptive days with Magnus... and well, they weren't all too great...$8",
        "AcceptGift_(O)260": "In the mood for some spice today, my love?$13#$b#I'm going to assume you want tonight's dinner to be extra spicy today with this.$8",
        "AcceptGift_(O)262": "You'll have to excuse my poor focaccia, I only know a few recipes, but I will give it my best.$8",
        "AcceptGift_(O)264": "Oooh? Would you like some radish kimchi today?$8#$b#It won't be fermented, unless you want me to use some magic on it.$9",
        "AcceptGift_(O)266": "I'll be honest, I can't really enjoy cabbage unless it has meat in it, and I know you're not keen on that.$8",
        "AcceptGift_(O)268": "Sweet as honey, soft as cotton, and what was the last one?$8#$b#Ah, right, hopelessly hopeful?$9#$b#I do find the old tales of starfruits to be used as ceremonial wish offerings to be quite interesting.$8",
        "AcceptGift_(O)270": "Are we making an artisan good today?$14#$b#No?$2#$b#Ah! Did you want me to think of something again today?$15#$b#Maybe some tamales then.",
        "AcceptGift_(O)271": "Shall I throw this into the mill for you, my love?$13#$b#I assume it's because you'd want a rice dish tonight.$8",
        "AcceptGift_(O)272": "Eggplants and eggs do go well together, don't they?$8#$b#Shall we have some as a side dish tonight?$9",
        "AcceptGift_(O)274": "I do love a good paella, let me know if you catch any good shrimp to go along with it.$15",
        "AcceptGift_(O)276": "Pumpkin potage tonight, my love?$13#$b#Or would you want my famous stuffed pumpkin?$8",
        "AcceptGift_(O)278": "I do love just throwing seafood into a pot with some bok choy, let me know if you don't want it as spicy as I usually make it.$8",
        "AcceptGift_(O)280": "I could never tell the difference between sweet potatoes and yams...$3#$b#...They're different in color?$14#$b#....I see... I've always used them interchangeably, thank you for the information, my love.$8",
        "AcceptGift_(O)281": "Hmm.. sweet.. peppery.. maybe just a prad prik king today?$8#$b#...What's that? Ah, right, apologies, it's a style of fried rice, my love. I hope you look forward to tonight's dinner.$9",
        "AcceptGift_(O)282": "I'll be honest, I only really have cranberries with alcohol.$8#$b#Call it an old adventuring habit of mine, something to warm the body on a cold night.$9",
        "AcceptGift_(O)283": "Would you like to do some decorating around the house with these?$14#$b#...They're not mistletoe?$3#$b#Oh! To make medicines for my trips?$15#$b#Thank you my love, for always thinking of me.$13",
        "AcceptGift_(O)284": "In the mood for a colorful dish tonight?$8#$b#I will try my best, but I'm not well versed in beets.$9",
        "AcceptGift_(O)290": "Are you concerned about the Highlands being in such a dangerous area?$8#$b#I assure you, my magic torches and surrounding barrier is enough to keep those monsters at bay, I thank you though, I'll probably have some use for it at some point.$9",
        "AcceptGift_(O)296": "The first flush of the season, was it?$8#$b#I thank you for sharing your spoils with me, my love.$9",
        "AcceptGift_(O)300": "...Are you telling me that I need to lose weight?$2#$b#No?$99#$b#Anti-inflammatory?$14#$b#Oh I assure you, I'm fine on my trips, my love.$15#$b#I appreciate the sentiment though, maybe I'll pass these onto Magnus since he delves more into potions than I do.$8",
        "AcceptGift_(O)303": "In the mood for a warmer evening tonight, my love?$13#$b#We can always enjoy ourselves in front of the fireplace and bask in each other's company.$8",
        "AcceptGift_(O)304": "I do have a fondness for dryer alcohol, not really one to be interested in the ales that give me a 'mustache', so to speak.$8",
        "AcceptGift_(O)305": "...I pray you simply purchased this from Krobus, Magnus has warned me of his ex-wife's random escapes and to be on the lookout.$20#$b#Although I'm unconcerned about her affecting us on the farm, it is still something to be wary about, my love.$8",
        "AcceptGift_(O)306": "I do hope you remembered to not use lemons in it this time.$8#$b#I'm not too fond of the sweet and sour taste of western mayonnaise.$9",
        "AcceptGift_(O)307": "A more, savoury mayonnaise?$14#$b#For me?$99#$b#Thank you, my love, you do know that I enjoy your sandwiches with a savoury sauce rather than the sweetened ones.$8",
        "AcceptGift_(O)308": "Interesting, very interesting.$3#$b#While I'm curious how this tastes, I think this would prove more useful as a ...no I'll surely be chastised by Camilla were I to use it on Magnus.$3#$b#I will stow this away for a rainy day, thank you my love.$13",
        "AcceptGift_(O)334": "A copper bar?$14#$b#Are you interested in my magic sword collection?$99#$b#While copper may not be seen as one of the most versatile, it is still quite useful in holding in heat.$8#$b#I guess it's only good for people like me, who usually harness flame.$9",
        "AcceptGift_(O)335": "Iron is definitely something that has more versatility than the other ores, I'll be sure to bring this to Marlon to see if we can fashion a new magic sword.$8#$b#Thank you, my love.$9",
        "AcceptGift_(O)336": "Would you like me to fashion an accessory for you?$14#$b#While I may not be good with crops, flamework is my forte.$99#$b#I'll be sure to figure out something for you.$8",
        "AcceptGift_(O)337": "Iridium?!$100#$b#Are you sure you won't have a use for it, my love?$14#$b#...For a magic sword...?$3#$b#Yes... curious, I could definitely make a few more knives out of something like this.$2#$b#Thank you, my love, I'll be sure to ask Marlon if he has any ideas.$8",
        "AcceptGift_(O)338": "A refined quartz?$14#$b#Are you interested in how magic artifacts are used?$8#$b#We can have a lesson to ourselves without Magnus' prying eyes.$13",
        "AcceptGift_(O)340": "Oh a decent sugar alternative!$15#$b#I will put this to good use in tonight's dinner if you so wished, my love.$13",
        "AcceptGift_(O)342": "Are you interested in how kimchi is made?$14#$b#It's quite a lengthy and messy process.$8#$b#We can always give it a go when we're not too busy.$9",
        "AcceptGift_(O)346": "Heady beers are my least favorite, but I'll always take the chance to bask in its warmth with you, my love.$8#$b#Although you must be careful if you get me too drunk.$11",
        "AcceptGift_(O)348": "I'm not fond of drinking wines on their own, but I do like their flavours in food.$8",
        "AcceptGift_(O)350": "A non alcoholic drink tonight? I will try to pair this well with the dishes tonight.$8",
        "AcceptGift_(O)368": "...I will take this as a sign that you are attempting to give me advice, but you know how inept I am at farmwork.$3#$b#I will hold onto this until you need it, however.$2#$e#I assume you're in need of it now?$13[368]",
        "AcceptGift_(O)369": "...Now I know that you're just messing with me.$8#$b#Is this your attempt of telling me that you can teach me farming while I teach you magic?$9#$e#You know I have no need for it, so I will hand it back.$8[369]",
        "AcceptGift_(O)370": "I understand that I am versed in fire magic, but it does not mean that I will singe the entire farm, my love.$8#$b#I just don't bode well with farmwork.$9",
        "AcceptGift_(O)371": "...I assure you, I will not burn down the farm, my love.$3",
        "AcceptGift_(O)372": "Clams are very versatile, and I do enjoy a good clam chowder.$8",
        "AcceptGift_(O)373": "For me? Are you sure you do not wish to use it for some other project?$14#$b#I will try to make good use of this for trading purposes, thank you my love.$8",
        "AcceptGift_(O)376": "Poppies were the most common form of drugs in the east.$8#$b#It's a shame that they're seen as vile even though I do love poppy seed muffins.$9",
        "AcceptGift_(O)396": "It's a shame that we don't have a mill for these spice berries, I do enjoy my wide variety of spices, as you know.$8",
        "AcceptGift_(O)397": "Oh? Urchins are one of my favorite types of sushi if you were so inclined for them tonight, I'll be sure to think of other dishes alongside it tonight, my love.$8",
        "AcceptGift_(O)398": "I do know of the choking hazards of grapes for infants, I'd still like to implement the flavour in some way...$3#$b#Maybe just juices until they're of age.$8",
        "AcceptGift_(O)399": "I'd have to say, it's a good thing you're not adverse to onions or garlic, we would be in a world of trouble with my cooking if you were.$8",
        "AcceptGift_(O)400": "It's always a tossup whether strawberries are good when it comes from the store, but yours always tend to have the best flavour.$13#$b#I wonder if that's because of the farm, or that's just your skills.$4",
        "AcceptGift_(O)402": "They're a lovely smell, aren't they?$8#$b#I'll have to find a vase to put these in to ensure the farmhouse is kept to a comfortable degree.$9",
        "AcceptGift_(O)404": "Sauteed mushrooms are usually my go-to for side dishes, I guess you can call it a work habit from being around Magnus for so long.$8",
        "AcceptGift_(O)406": "I still remember the recipe for some maesil ju if you're interested, these plums look good for a darker brew.$8",
        "AcceptGift_(O)408": "Hmmm... hazelnuts, I'm not too good with making deserts, so you would have to help me on that front, my love.$8",
        "AcceptGift_(O)410": "Mulled blackberry wine is always nice on a winter's night, isn't it?$8#$b#Care to join me in front of a fire and enjoy this together?$9",
        "AcceptGift_(O)412": "I'm always unsure of what exactly a 'winter root' is.$3#$b#Magnus says they're a type of sweet potato but I'm skeptical...$2",
        "AcceptGift_(O)414": "Beautiful, aren't they? I guess they're akin to other seasonal berries, but something about the ferocity of growing in winter makes them special.$8",
        "AcceptGift_(O)416": "Ah, more yams? Would you want to just roast these over an open fire?$14#$b#I have no qualms if you'd like to enjoy a snack with me.$9#$e#Here, my love, I've toasted it.$8[208]",
        "AcceptGift_(O)417": "A... what is that?$14#$b#A sweet gem berry?$3#$b#Rare seed?$2#$b#Oh! From my seed pouch!$14#$b#I see you've managed to properly flourish it.$8#$b#I have no actual use for it, the Ministry simply wanted to know how Magnus was doing at the time and thought that I would beg for his mercy about seeds.$9#$b#I will give this back to you, you have a much better use for it than I will, my love.$8[417]",
        "AcceptGift_(O)423": "Ah tried and true, I cannot escape my heritage.$8#$b#I hope you don't mind my incessant need to have rice with all of my meals.$9#$b#Thank you for thinking of me, my love.$8",
        "AcceptGift_(O)Aviroen.Mycology_TomYueaPhai": "Oh! A traditional Thai dish, my love?$14#$b#Something feels off about this one though--$14#$b#!!!$42#$b#Did you just feed me a love potion instead of a soup?$43",

        "AcceptGift_(O){{ModId}}_Khanjar": "$v {{DatePelican}} true false",
        "AcceptGift_(O){{ModId}}_Book": "$v {{DateGrandpa}} true false",

        "AcceptGift_category_cooking": "{{i18n:Married.GiftReactionCategory_-7}}",
        "AcceptGift_category_artisan_goods": "{{i18n:Married.GiftReactionPreserved_Any}}",
        ///sve related
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Void_Soul": "{{i18n:Married.GiftReaction_Void_Soul}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Swirl_Stone": "{{i18n:Married.GiftReaction_Swirl_Stone}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Dewdrop_Berry": "{{i18n:Married.GiftReaction_Dewdrop_Berry}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Frog": "{{i18n:Married.GiftReaction_Frog}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Kittyfish": "{{i18n:Married.GiftReaction_Kittyfish}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Blue_Moon_Wine": "{{i18n:Married.GiftReaction_Blue_Moon_Wine}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Age_Blue_Moon_Wine": "{{i18n:Married.GiftReaction_Blue_Moon_Wine}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Void_Shard": "{{i18n:Married.GiftReaction_Void_Shard}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Baby_Lunaloo": "{{i18n:Married.GiftReaction_Baby_Lunaloo}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Undeadfish": "{{i18n:Married.GiftReaction_Undeadfish}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Gemfish": "{{i18n:Married.GiftReaction_Gemfish}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Goldenfish": "{{i18n:Married.GiftReaction_Goldenfish}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Monster_Fruit": "{{i18n:Married.GiftReaction_Monster_Fruit}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Void_Eel": "$1 {{ModId}}_VoidEel#{{i18n:Married.GiftReaction_Void_Eel}}#$e#{{i18n:Married.GiftReaction_Void_Eel2}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Torpedo_Trout": "{{i18n:Married.GiftReaction_Torpedo_Trout}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Lunaloo": "{{i18n:Married.GiftReaction_Lunaloo}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Shiny_Lunaloo": "{{i18n:Married.GiftReaction_Shiny_Lunaloo}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Radioactive_Bass": "$query !PLAYER_HAS_MAIL LanceMeetsKrobus#{{i18n:Married.GiftReaction_Radioactive_Bass}}|{{i18n:Married.GiftReaction_Radioactive_Bass2}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Slime_Berry": "{{i18n:Married.GiftReaction_Slime_Berry}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Void_Root": "$query !PLAYER_HAS_MAIL LanceMeetsKrobus#Thank you, my love, the research is going quite well on these crops.$8|For my trips to Krobus?$8#$b#I haven't been able to make a dish with this as it tends to... become extremely volatile when handled.$11#$b#Thankfully Krobus doesn't seem to mind and eats them as is, thank you, my love.$8",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Monster_Mushroom": "{{i18n:Married.GiftReaction_Monster_Mushroom}}",
        //Cooking
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Frog_Legs": "{{i18n:Married.GiftReaction_Frog_Legs}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Void_Delight": "{{i18n:Married.GiftReaction_Void_Delight}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Void_Salmon_Sushi": "{{i18n:Married.GiftReaction_Void_Salmon_Sushi}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Grampleton_Orange_Chicken": "{{i18n:Married.GiftReaction_Grampleton_Orange_Chicken}}", //Not made by player
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Baked_Berry_Oatmeal": "{{i18n:Married.GiftReaction_Baked_Berry_Oatmeal}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Big_Bark_Burger": "{{i18n:Married.GiftReaction_Big_Bark_Burger}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Flower_Cookie": "{{i18n:Married.GiftReaction_Flower_Cookie}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Glazed_Butterfish": "{{i18n:Married.GiftReaction_Glazed_Butterfish}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Mixed_Berry_Pie": "{{i18n:Married.GiftReaction_Mixed_Berry_Pie}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Mushroom_Berry_Rice": "{{i18n:Married.GiftReaction_Mushroom_Berry_Rice}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Seaweed_Salad": "{{i18n:Married.GiftReaction_Seaweed_Salad}}"
        //Fall back

      }
    }
    /*
    {
      "LogName": "Gifts: Pregnant",
      "Action": "EditData",
      "Target": "Characters/Dialogue/Lance",
      "When": {
        "HasSeenEvent": "64780030",
        "HavingChild": "@{{playerName}}",
        "Relationship:Lance": "Married"
   },
      "Entries": {

        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Void_Soul": "{{i18n:Preg.GiftReaction_Void_Soul}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Swirl_Stone": "{{i18n:Preg.GiftReaction_Void_Soul}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Void_Shard": "{{i18n:Preg.GiftReaction_Void_Shard}}",
        "AcceptGift_category_cooking": "{{i18n:Preg.GiftReactionCategory_-7}} ",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Blue_Moon_Wine": "{{i18n:Preg.GiftReaction_Blue_Moon_Wine}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Age_Blue_Moon_Wine": "{{i18n:Preg.GiftReaction_Blue_Moon_Wine}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Radioactive_Bass": "{{i18n:Preg.GiftReaction_Radiation}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Void_Eel": "{{i18n:Preg.GiftReaction_Void_Eel}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Undeadfish": "{{i18n:Preg.GiftReaction_Undeadfish}}",
        "AcceptGift_(O)FlashShifter.StardewValleyExpandedCP_Gemfish": "{{i18n:Preg.GiftReaction_Gemfish}}",
 
   },
 },
*/
  ]
}
